zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/msp432p4xx/inc/msp432p411y.h
#define LCD_F_ANMCTL_ANMPRE_OFS                  (16)                            /*!< LCDANMPREx Bit Offset */
#define LCD_F_ANMCTL_ANMPRE_MASK                 ((uint32_t)0x00070000)          /*!< LCDANMPREx Bit Mask */
#define LCD_F_ANMCTL_ANMPRE0                     ((uint32_t)0x00010000)          /*!< ANMPRE Bit 0 */
#define LCD_F_ANMCTL_ANMPRE1                     ((uint32_t)0x00020000)          /*!< ANMPRE Bit 1 */
#define LCD_F_ANMCTL_ANMPRE2                     ((uint32_t)0x00040000)          /*!< ANMPRE Bit 2 */
#define LCD_F_ANMCTL_ANMPRE_0                    ((uint32_t)0x00000000)          /*!< Divide by 512 */
#define LCD_F_ANMCTL_ANMPRE_1                    ((uint32_t)0x00010000)          /*!< Divide by 1024 */
#define LCD_F_ANMCTL_ANMPRE_2                    ((uint32_t)0x00020000)          /*!< Divide by 2048 */
#define LCD_F_ANMCTL_ANMPRE_3                    ((uint32_t)0x00030000)          /*!< Divide by 4096 */
#define LCD_F_ANMCTL_ANMPRE_4                    ((uint32_t)0x00040000)          /*!< Divide by 8162 */
#define LCD_F_ANMCTL_ANMPRE_5                    ((uint32_t)0x00050000)          /*!< Divide by 16384 */
#define LCD_F_ANMCTL_ANMPRE_6                    ((uint32_t)0x00060000)          /*!< Divide by 32768 */
#define LCD_F_ANMCTL_ANMPRE_7                    ((uint32_t)0x00070000)          /*!< Divide by 65536 */
/* LCD_F_ANMCTL[ANMDIV] Bits */
#define LCD_F_ANMCTL_ANMDIV_OFS                  (19)                            /*!< LCDANMDIVx Bit Offset */
#define LCD_F_ANMCTL_ANMDIV_MASK                 ((uint32_t)0x00380000)          /*!< LCDANMDIVx Bit Mask */
#define LCD_F_ANMCTL_ANMDIV0                     ((uint32_t)0x00080000)          /*!< ANMDIV Bit 0 */
#define LCD_F_ANMCTL_ANMDIV1                     ((uint32_t)0x00100000)          /*!< ANMDIV Bit 1 */
#define LCD_F_ANMCTL_ANMDIV2                     ((uint32_t)0x00200000)          /*!< ANMDIV Bit 2 */
#define LCD_F_ANMCTL_ANMDIV_0                    ((uint32_t)0x00000000)          /*!< Divide by 1 */
#define LCD_F_ANMCTL_ANMDIV_1                    ((uint32_t)0x00080000)          /*!< Divide by 2 */
#define LCD_F_ANMCTL_ANMDIV_2                    ((uint32_t)0x00100000)          /*!< Divide by 3 */
#define LCD_F_ANMCTL_ANMDIV_3                    ((uint32_t)0x00180000)          /*!< Divide by 4 */
#define LCD_F_ANMCTL_ANMDIV_4                    ((uint32_t)0x00200000)          /*!< Divide by 5 */
#define LCD_F_ANMCTL_ANMDIV_5                    ((uint32_t)0x00280000)          /*!< Divide by 6 */
#define LCD_F_ANMCTL_ANMDIV_6                    ((uint32_t)0x00300000)          /*!< Divide by 7 */
#define LCD_F_ANMCTL_ANMDIV_7                    ((uint32_t)0x00380000)          /*!< Divide by 8 */
/* LCD_F_IE[BLKOFFIE] Bits */
#define LCD_F_IE_BLKOFFIE_OFS                    ( 1)                            /*!< LCDBLKOFFIE Bit Offset */
#define LCD_F_IE_BLKOFFIE                        ((uint32_t)0x00000002)          /*!< LCD Blink, segments off interrupt enable */
/* LCD_F_IE[BLKONIE] Bits */
#define LCD_F_IE_BLKONIE_OFS                     ( 2)                            /*!< LCDBLKONIE Bit Offset */
#define LCD_F_IE_BLKONIE                         ((uint32_t)0x00000004)          /*!< LCD Blink, segments on interrupt enable */
/* LCD_F_IE[FRMIE] Bits */
#define LCD_F_IE_FRMIE_OFS                       ( 3)                            /*!< LCDFRMIE Bit Offset */
#define LCD_F_IE_FRMIE                           ((uint32_t)0x00000008)          /*!< LCD Frame interrupt enable */
/* LCD_F_IE[ANMSTPIE] Bits */
#define LCD_F_IE_ANMSTPIE_OFS                    ( 8)                            /*!< LCDANMSTPIE Bit Offset */
#define LCD_F_IE_ANMSTPIE                        ((uint32_t)0x00000100)          /*!< LCD Animation step interrupt enable */
/* LCD_F_IE[ANMLOOPIE] Bits */
#define LCD_F_IE_ANMLOOPIE_OFS                   ( 9)                            /*!< LCDANMLOOPIE Bit Offset */
#define LCD_F_IE_ANMLOOPIE                       ((uint32_t)0x00000200)          /*!< LCD Animation loop interrupt enable */
/* LCD_F_IFG[BLKOFFIFG] Bits */
#define LCD_F_IFG_BLKOFFIFG_OFS                  ( 1)                            /*!< LCDBLKOFFIFG Bit Offset */
#define LCD_F_IFG_BLKOFFIFG                      ((uint32_t)0x00000002)          /*!< LCD Blink, segments off interrupt flag */
/* LCD_F_IFG[BLKONIFG] Bits */
#define LCD_F_IFG_BLKONIFG_OFS                   ( 2)                            /*!< LCDBLKONIFG Bit Offset */
#define LCD_F_IFG_BLKONIFG                       ((uint32_t)0x00000004)          /*!< LCD Blink, segments on interrupt flag */
/* LCD_F_IFG[FRMIFG] Bits */
#define LCD_F_IFG_FRMIFG_OFS                     ( 3)                            /*!< LCDFRMIFG Bit Offset */
#define LCD_F_IFG_FRMIFG                         ((uint32_t)0x00000008)          /*!< LCD Frame interrupt flag */
/* LCD_F_IFG[ANMSTPIFG] Bits */
#define LCD_F_IFG_ANMSTPIFG_OFS                  ( 8)                            /*!< LCDANMSTPIFG Bit Offset */
#define LCD_F_IFG_ANMSTPIFG                      ((uint32_t)0x00000100)          /*!< LCD Animation step interrupt flag */
/* LCD_F_IFG[ANMLOOPIFG] Bits */
#define LCD_F_IFG_ANMLOOPIFG_OFS                 ( 9)                            /*!< LCDANMLOOPIFG Bit Offset */
#define LCD_F_IFG_ANMLOOPIFG                     ((uint32_t)0x00000200)          /*!< LCD Animation loop interrupt flag */
/* LCD_F_SETIFG[SETLCDBLKOFFIFG] Bits */
#define LCD_F_SETIFG_SETLCDBLKOFFIFG_OFS         ( 1)                            /*!< SETLCDBLKOFFIFG Bit Offset */
#define LCD_F_SETIFG_SETLCDBLKOFFIFG             ((uint32_t)0x00000002)          /*!< Sets LCDBLKOFFIFG */
/* LCD_F_SETIFG[SETLCDBLKONIFG] Bits */
#define LCD_F_SETIFG_SETLCDBLKONIFG_OFS          ( 2)                            /*!< SETLCDBLKONIFG Bit Offset */
#define LCD_F_SETIFG_SETLCDBLKONIFG              ((uint32_t)0x00000004)          /*!< Sets LCDBLKONIFG */
/* LCD_F_SETIFG[SETLCDFRMIFG] Bits */
#define LCD_F_SETIFG_SETLCDFRMIFG_OFS            ( 3)                            /*!< SETLCDFRMIFG Bit Offset */
#define LCD_F_SETIFG_SETLCDFRMIFG                ((uint32_t)0x00000008)          /*!< Sets LCDFRMIFG */
/* LCD_F_SETIFG[SETLCDANMSTPIFG] Bits */
#define LCD_F_SETIFG_SETLCDANMSTPIFG_OFS         ( 8)                            /*!< SETLCDANMSTPIFG Bit Offset */
#define LCD_F_SETIFG_SETLCDANMSTPIFG             ((uint32_t)0x00000100)          /*!< Sets LCDANMSTPIFG */
/* LCD_F_SETIFG[SETLCDANMLOOPIFG] Bits */
#define LCD_F_SETIFG_SETLCDANMLOOPIFG_OFS        ( 9)                            /*!< SETLCDANMLOOPIFG Bit Offset */
#define LCD_F_SETIFG_SETLCDANMLOOPIFG            ((uint32_t)0x00000200)          /*!< Sets LCDANMLOOPIFG */
/* LCD_F_CLRIFG[CLRLCDBLKOFFIFG] Bits */
#define LCD_F_CLRIFG_CLRLCDBLKOFFIFG_OFS         ( 1)                            /*!< CLRLCDBLKOFFIFG Bit Offset */
#define LCD_F_CLRIFG_CLRLCDBLKOFFIFG             ((uint32_t)0x00000002)          /*!< Clears LCDBLKOFFIFG */
/* LCD_F_CLRIFG[CLRLCDBLKONIFG] Bits */
#define LCD_F_CLRIFG_CLRLCDBLKONIFG_OFS          ( 2)                            /*!< CLRLCDBLKONIFG Bit Offset */
#define LCD_F_CLRIFG_CLRLCDBLKONIFG              ((uint32_t)0x00000004)          /*!< Clears LCDBLKONIFG */
/* LCD_F_CLRIFG[CLRLCDFRMIFG] Bits */
#define LCD_F_CLRIFG_CLRLCDFRMIFG_OFS            ( 3)                            /*!< CLRLCDFRMIFG Bit Offset */
#define LCD_F_CLRIFG_CLRLCDFRMIFG                ((uint32_t)0x00000008)          /*!< Clears LCDFRMIFG */
/* LCD_F_CLRIFG[CLRLCDANMSTPIFG] Bits */
#define LCD_F_CLRIFG_CLRLCDANMSTPIFG_OFS         ( 8)                            /*!< CLRLCDANMSTPIFG Bit Offset */
#define LCD_F_CLRIFG_CLRLCDANMSTPIFG             ((uint32_t)0x00000100)          /*!< Clears LCDANMSTPIFG */
/* LCD_F_CLRIFG[CLRLCDANMLOOPIFG] Bits */
#define LCD_F_CLRIFG_CLRLCDANMLOOPIFG_OFS        ( 9)                            /*!< CLRLCDANMLOOPIFG Bit Offset */
#define LCD_F_CLRIFG_CLRLCDANMLOOPIFG            ((uint32_t)0x00000200)          /*!< Clears LCDANMLOOPIFG */

